tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-versions", "https://github.com/caskroom/homebrew-versions"
tap "pivotal/tap"
tap "snyk/tap"
tap "spring-io/tap"
tap "teamookla/speedtest"
# Search tool like grep, but optimized for programmers
brew "ack"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Mozilla CA certificate store
brew "ca-certificates"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Core application library for C
brew "glib"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Shell extension to jump to frequently used directories
brew "autojump"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bash shell debugger
brew "bashdb"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Check Java source against a coding standard
brew "checkstyle"
# Rootkit detector
brew "chkrootkit"
# Console Matrix
brew "cmatrix"
# Filename encoding conversion tool
brew "convmv"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C library implementing the SSH2 protocol
brew "libssh2"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose", link: false
# Text processing system for reStructuredText
brew "docutils"
# Charset analyzer and converter
brew "enca"
# Convert text to Postscript, HTML, or RTF, with syntax highlighting
brew "enscript"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image processing and image analysis library
brew "leptonica"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Web application framework for the Groovy language
brew "grails"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Java-based scripting language
brew "groovy"
# SDK for Groovy: a Java-based scripting language
brew "groovysdk", link: false
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Java servlet engine and webserver
brew "jetty"
# Use Jetty without an installed distribution
brew "jetty-runner"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Curses-based password manager for KeePass v.1.x and KeePassX
brew "keepassc"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Statically typed programming language for the JVM
brew "kotlin"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Build tool for Clojure
brew "leiningen"
# Multi-format archive and compression library
brew "libarchive"
# GObject wrappers for libusb1
brew "libgusb"
# Building blocks for modern adaptive GNOME apps
brew "libhandy"
# Friendly wrapper for launchctl
brew "lunchy"
# Java-based project management
brew "maven"
# Terminal-based visual file manager
brew "midnight-commander"
# Run a Kubernetes cluster locally
brew "minikube"
# Move, copy, append, and link multiple files
brew "mmv"
# Open source relational database management system
brew "mysql"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Extract ISO9660 data from Nero nrg files
brew "nrg2iso"
# Manage multiple Node.js versions
brew "nvm"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# SOcket CAT: netcat on steroids
brew "socat"
# OpenShift command-line interface tools
brew "openshift-cli"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Create TCP tunnels through HTTPS proxies
brew "proxytunnel"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: false
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Standard unix software packaging tool
brew "rpm"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Run scalastyle from the command-line
brew "scalastyle"
# GNOME document scanning application
brew "simple-scan"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# SSL tunneling program
brew "stunnel"
# Version control system designed to be a better CVS
brew "subversion"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Powerful free data recovery utility
brew "testdisk"
# Terminal multiplexer
brew "tmux"
# CPU, RAM memory, and load monitor for use with tmux
brew "tmux-mem-cpu-load"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Implementation of Java Servlet and JavaServer Pages
brew "tomcat"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Ncurses-based klondike solitaire game
brew "tty-solitaire"
# Compress/expand executable files
brew "upx"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
# Zsh curses-based tools, e.g. multi-word history searcher
brew "zsh-navigation-tools"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Debugger for zsh
brew "zshdb"
# Find & fix known vulnerabilities in open-source dependencies
brew "snyk/tap/snyk", link: false
brew "spring-io/tap/spring-boot"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Text editor
cask "atom"
# Utility to create and modify archives
cask "betterzip"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# Opensource IDE for exploring and testing api's
cask "bruno"
# CD burning application
cask "burn"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Remove junk and unused files
cask "ccleaner"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Free and open-source web browser
cask "chromium"
# Downloads videos and audio from websites
cask "clipgrab"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# Trains AIs to understand and translate texts
cask "deepl"
# Visually compare and merge files
cask "diffmerge"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Eclipse IDE for Java EE developers
cask "eclipse-jee"
# Video and audio player
cask "elmedia-player"
# Text editor
cask "emacs"
# Web browser
cask "firefox-developer-edition"
# Disk partitioning tool
cask "gdisk"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Tools to protect your emails and files
cask "gpg-suite"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Desktop automation application
cask "hammerspoon"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Legacy runtime for the Java programming language
cask "java6"
# Standalone Java Decompiler GUI
cask "jd-gui"
# Java profiler
cask "jprofiler"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# End-to-end encryption software
cask "keybase"
# GUI replacement for the Java command-line utilities keytool and jarsigner
cask "keystore-explorer"
# Audio tagger focusing on efficiency
cask "kid3"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Collection of alternate languages for LibreOffice
cask "libreoffice-language-pack"
# Warns about malware, adware and spyware
cask "malwarebytes"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Upload music to the Google Music library
cask "music-manager"
# Music tagger
cask "musicbrainz-picard"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cloud storage client
cask "onedrive"
# Web browser
cask "opera"
# Documentation for the Oracle JDK
cask "oracle-jdk-javadoc"
# File system integration
cask "osxfuse"
# Image editor
cask "paintbrush"
# HTTP client that helps testing and describing APIs
cask "paw"
# GUI prototyping tool
cask "pencil"
# Simple Gtk# Paint Program
cask "pinta"
# Property list and JSON editor
cask "plistedit-pro"
# Collaboration platform for API development
cask "postman"
# VPN client focusing on security
cask "protonvpn"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Scans, detects, and monitors keyboard taps
cask "reikey"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Video editor
cask "shotcut"
# Instant messaging application focusing on security
cask "signal"
# Sets a minimum speed for built-in fans
cask "smcfancontrol"
cask "soundflower"
# Taps into Soundflower channels and route them to an audio device
cask "soundflowerbed"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
# Next generation tooling for Spring Boot
cask "springtoolsuite"
# Manage and install Squid proxy cache
cask "squidman"
# IDE, client, and GUI for MongoDB
cask "studio-3t"
# Text editor for code, markup and prose
cask "sublime-text"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Customizable email client
cask "thunderbird"
# Customizable timing of breaks
cask "time-out"
# Development environment
cask "vagrant"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Virtualiser for x86 hardware
cask "virtualbox"
# UML, SysML, BPMN modelling platform
cask "visual-paradigm-ce"
# Open-source code editor
cask "visual-studio-code"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# Multimedia player
cask "vlc"
# App that provides drivers for older model scanners that are no longer supported
cask "vuescan"
# Mirror and control your phone
cask "vysor"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "webex-meetings"
# Network protocol analyzer
cask "wireshark"
# Lossless audio decoder
cask "xld"
# Photo viewer, image manager, image resiser and more
cask "xnviewmp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# System monitor
cask "xrg"
# Create diagrams manually, or import external data for analysis
cask "yed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "davidanson.vscode-markdownlint"
vscode "dorian-marchal.add-line-break"
vscode "dotjoshjohnson.xml"
vscode "estivo.csv-editor"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "huntertran.auto-markdown-toc"
vscode "janisdd.vscode-edit-csv"
vscode "khaeransori.json2csv"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "shengchen.vscode-checkstyle"
vscode "skn0tt.markdown-link-expander"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzhang.markdown-all-in-one"
